In [ ]:
#DATA INPUT AND OUTPUT (I/O)

In [1]:
import pandas as pd
df = pd.read_csv('industry.csv')
df

     City  Sales  Year
0   Delhi    200  2023
1   Delhi    150  2024
2  Mumbai    300  2023
3  Mumbai    250  2024

In [4]:
dm = pd.read_csv('industry.csv', usecols=['City', 'Sales'])
print(dm)

     City  Sales
0   Delhi    200
1   Delhi    150
2  Mumbai    300
3  Mumbai    250

In [11]:
df = pd.read_csv('industry.csv', na_values=["N/A", "Unknown"])
print(df)

     City  Sales  Year
0   Delhi    200  2023
1   Delhi    150  2024
2  Mumbai    300  2023
3  Mumbai    250  2024

In [12]:
import pandas as pd

data = """totalbill_tip, sex:smoker, day_time, size
16.99, 1.01:Female|No, Sun, Dinner, 2
10.34, 1.66, Male, No|Sun:Dinner, 3
21.01:3.5_Male, No:Sun, Dinner, 3
23.68, 3.31, Male|No, Sun_Dinner, 2
24.59:3.61, Female_No, Sun, Dinner, 4
25.29, 4.71|Male, No:Sun, Dinner, 4"""

with open("sample.csv", "w") as file:
    file.write(data)
print(data)

totalbill_tip, sex:smoker, day_time, size
16.99, 1.01:Female|No, Sun, Dinner, 2
10.34, 1.66, Male, No|Sun:Dinner, 3
21.01:3.5_Male, No:Sun, Dinner, 3
23.68, 3.31, Male|No, Sun_Dinner, 2
24.59:3.61, Female_No, Sun, Dinner, 4
25.29, 4.71|Male, No:Sun, Dinner, 4

In [13]:
df = pd.read_csv('industry.csv', nrows=3)
df

     City  Sales  Year
0   Delhi    200  2023
1   Delhi    150  2024
2  Mumbai    300  2023

In [16]:
df= pd.read_csv("industry.csv")
print("Previous Dataset: ")
print(df)
# using skiprows
df = pd.read_csv("industry.csv", skiprows = [4,5])
print("Dataset After skipping rows: ")
print(df)

Previous Dataset:
     City  Sales  Year
0   Delhi    200  2023
1   Delhi    150  2024
2  Mumbai    300  2023
3  Mumbai    250  2024
Dataset After skipping rows:
     City  Sales  Year
0   Delhi    200  2023
1   Delhi    150  2024
2  Mumbai    300  2023

In [18]:
df = pd.read_csv('industry.csv')
print(df.info())
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   City    4 non-null      object
 1   Sales   4 non-null      int64
 2   Year    4 non-null      int64
dtypes: int64(2), object(1)
memory usage: 228.0+ bytes
None
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   City    4 non-null      object
 1   Sales   4 non-null      int64
 2   Year    4 non-null      int64
dtypes: int64(2), object(1)
memory usage: 228.0+ bytes
None

In [ ]:
#read a csv data from url
url = "https://media.geeksforgeeks.org/wp-content/uploads/20241121154629307916/people_data.csv"
df = pd.read_csv(url)
df

,First Name,Last Name,Sex,Email,Date of birth,Job Title
0,Shelby,Terrell,Male,elijah57@example.net,1945-10-26,Games developer
1,Phillip,Summers,Female,bethany14@example.com,1910-03-24,Phytotherapist
2,Kristine,Travis,Male,bthompson@example.com,1992-07-02,Homeopath
3,Yesenia,Martinez,Male,kaitlinkaiser@example.com,2017-08-03,Market researcher
4,Lori,Todd,Male,buchananmanuel@example.net,1938-12-01,Veterinary surgeon

In [ ]:
import pandas as pd

nme = ["aparna", "pankaj", "sudhir", "Geeku"]
deg = ["MBA", "BCA", "M.Tech", "MBA"]
scr = [90, 40, 80, 98]

data = {'name': nme, 'degree': deg, 'score': scr}

df = pd.DataFrame(data)

In [ ]:
df.to_csv('file1.csv') #export csv to a working directory

In [22]:
#Saving file without header or index 
df.to_csv('file2.csv', header=False, index=False)

In [23]:
import pandas as pd
import numpy as np

users = {'Name': ['Amit', 'Cody', 'Drew'],
    'Age': [20,21,25]}

df = pd.DataFrame(users, columns=['Name','Age'])

print("Original DataFrame:")
print(df)
print('Data from Users.csv:')

df.to_csv('Users.csv', sep='\t', index=False,header=True)
new_df = pd.read_csv('Users.csv')

print(new_df)

Original DataFrame:
   Name  Age
0  Amit   20
1  Cody   21
2  Drew   25
Data from Users.csv:
  Name\tAge
0  Amit\t20
1  Cody\t21
2  Drew\t25

In [24]:
#Exporting dataframe to csv
df.to_csv("your_name.csv")

In [25]:
#Customizing the csv export
df.to_csv('your_name.csv', index = False)

In [26]:
#export only selected columns
df.to_csv("your_name.csv", columns = ['Name'])

In [27]:
#Exclude Header row
df.to_csv('your_name.csv', header = False)

In [ ]:
#Handling misssing data
df.to_csv("your_name.csv", na_rep = 'nothing')

In [28]:
#Chnage column separator
df.to_csv("your_name.csv", na_rep = 'nothing')

In [29]:
df.to_csv("your_name.csv", sep ='\t')

In [32]:
#. Using json Module and pd.json_normalize() method
import pandas as pd
import json

data = {"One": {"0": 60, "1": 60, "2": 60, "3": 45, "4": 45, "5": 60},
        "Two": {"0": 110, "1": 117, "2": 103, "3": 109, "4": 117, "5": 102}}

json_data = json.dumps(data)

df_normalize = pd.json_normalize(json.loads(json_data))
print("\nDataFrame using JSON module and `pd.json_normalize()` method:")
df_normalize

DataFrame using JSON module and `pd.json_normalize()` method:

,One.0,One.1,One.2,One.3,One.4,One.5,Two.0,Two.1,Two.2,Two.3,Two.4,Two.5
0,60,60,60,45,45,60,110,117,103,109,117,102

In [33]:
import pandas as pd
df = pd.DataFrame(data)
print(df)

   One  Two
0   60  110
1   60  117
2   60  103
3   45  109
4   45  117
5   60  102

In [34]:
df = pd.DataFrame([['a', 'b'], ['c', 'd']],
                  index=['row 1', 'row 2'],
                  columns=['col 1', 'col 2'])

print(df.to_json(orient='split')) 
print(df.to_json(orient='index'))

{"columns":["col 1","col 2"],"index":["row 1","row 2"],"data":[["a","b"],["c","d"]]}
{"row 1":{"col 1":"a","col 2":"b"},"row 2":{"col 1":"c","col 2":"d"}}

In [35]:
import pandas as pd
import requests

url = 'https://jsonplaceholder.typicode.com/posts'
response = requests.get(url)

data = pd.json_normalize(response.json())
data.head()

,userId,id,title,body
0,1,1,sunt aut facere repellat provident occaecati e...,quia et suscipit\nsuscipit recusandae consequu...
1,1,2,qui est esse,est rerum tempore vitae\nsequi sint nihil repr...
2,1,3,ea molestias quasi exercitationem repellat qui...,et iusto sed quo iure\nvoluptatem occaecati om...
3,1,4,eum et est occaecati,ullam et saepe reiciendis voluptatem adipisci\...
4,1,5,nesciunt quas odio,repudiandae veniam quaerat sunt sed\nalias aut...

In [ ]:
import json  
import pandas as pd  
from pandas import json_normalize  

with open('/content/raw_nyc_phil.json') as f:
    d = json.load(f)

nycphil = json_normalize(d['programs'])
nycphil.head(3)

In [37]:
import pandas as pd

df = pd.DataFrame(data=[
    ['15135', 'Alex', '25/4/2014'],
    ['23515', 'Bob', '26/8/2018'],
    ['31313', 'Martha', '18/1/2019'],
    ['55665', 'Alen', '5/5/2020'],
    ['63513', 'Maria', '9/12/2020']],
    columns=['ID', 'NAME', 'DATE OF JOINING'])

df.to_json('file1.json', orient='split', compression='infer')

df = pd.read_json('file1.json', orient='split', compression='infer')
print(df)

      ID    NAME DATE OF JOINING
0  15135    Alex       25/4/2014
1  23515     Bob       26/8/2018
2  31313  Martha       18/1/2019
3  55665    Alen        5/5/2020
4  63513   Maria       9/12/2020

In [38]:
df.to_json('file.json', orient='records')

In [39]:
import pandas as pd
df = pd.read_excel('output.xlsx')
df

     City  Sales  Year
0   Delhi    200  2023
1   Delhi    150  2024
2  Mumbai    300  2023
3  Mumbai    250  2024

In [48]:
#The fwf in the read_fwf() function stands for fixed-width lines. We can use this function to load DataFrames
# from files. This function also supports text files. 
# Read Text Files with Pandas using read_fwf()

import pandas as pd

df = pd.read_fwf("hello.txt")
print(df)

Empty DataFrame
Columns: ["my, name, is, gunja, mahapatra"]
Index: []

In [51]:
#Converting text files to csv
import pandas as pd

df1 = pd.read_csv("hello.txt")

df1.to_csv('hello.csv', index = None)

websites = pd.read_csv("hello.txt", header = None)

# try splitting the single-column frame into three columns using common delimiters
parts = websites[0].str.split(',', expand=True)
if parts.shape[1] < 3:
  parts = websites[0].str.split(r'\s+', n=2, expand=True)  # fallback: split on whitespace into up to 3 parts

# ensure we have exactly 3 columns and assign names
parts = parts.iloc[:, :3]
parts.columns = ['Name', 'Type', 'Website']
websites = parts

websites.to_csv('hello.csv', index = None)

In [49]:
import pandas as pd

account = pd.read_csv("hello.txt", delimiter = '/')
account.to_csv('hello.csv', index = None)